/*******************************************************************************
*  電源が入ると，シリアルコンソールで入力を待受け，ある文字が入力されると
*  センサのデータを読み取り，シリアルコンソールに出力するプログラム
*******************************************************************************/

/*******************************************************************************
*  機能のON/OFFなど
*******************************************************************************/
// 特に無し

/*******************************************************************************
*  ピン番号の指定
*******************************************************************************/
/* 温度・湿度センサの接続先ピン(センサ処理の例のため) */
#define DHT_PIN 2            // DHTシリーズの温湿度センサを接続するピン番号
/*******************************************************************************
*  定数の指定
*******************************************************************************/
#define COMMAND_CHAR 'a'
/*******************************************************************************
*  センサ関係処理
*  注意事項 :
*    ・本来この部分はユーザが開発する
*    ・DHTシリーズのセンサを用いるこのプログラムはあくまでサンプル
*    ・今回使うのはDHTシリーズセンサ用ライブラリのうち，https://github.com/markruys/arduino-DHT
*******************************************************************************/
#include "DHT.h"

DHT dht;


/* センサの起動時の初期化処理 */
void setupSensor()
{
  dht.setup(DHT_PIN); // DHTをセットアップ
  Serial.println("Status\tHumidity (%)\tTemperature (C)\t(F)");
}

/* センサ処理 */
void getSensorValue(){
  delay(dht.getMinimumSamplingPeriod());
  float humidity = dht.getHumidity();
  float temperature = dht.getTemperature();

  Serial.print(dht.getStatusString());
  Serial.print("\t");
  Serial.print(humidity, 1);
  Serial.print("\t\t");
  Serial.print(temperature, 1);
  Serial.print("\t\t");
  Serial.println(dht.toFahrenheit(temperature), 1);
}
/*******************************************************************************
*  ここからプログラム本体
*******************************************************************************/
/*******************************************************************************
*  各種定義
*******************************************************************************/
// 特になし
/*******************************************************************************
*  初期化処理
*******************************************************************************/
void setup()
{
  Serial.begin(9600);
  Serial.println();
  setupSensor();
}

/*******************************************************************************
*  ループ
*******************************************************************************/
void loop()
{
  if (Serial.available()){
    int data;
    data=Serial.read();
    switch(data){
      case COMMAND_CHAR :
        getSensorValue();
        break;
    }
  }
}

